Revit 2027 API
TextElement.UpDirection Property
 Direction along the vertical axis of letters of the text note.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ UpDirection { get; }
Public ReadOnly Property UpDirection As XYZ
	Get
public:
property XYZ^ UpDirection {
	XYZ^ get ();
}
member UpDirection : XYZ with get
Property Value
XYZ
Remarks
This vector points up from the base of the letters and is always perpendicular to the base direction. Those two vectors together define the plane of the text.
See Also
Reference
TextElement Class
Autodesk.Revit.DB Namespace